# dowhile-9999-1

Последовательность 
Вывести последовательность чисел, поступившую на вход.

Входные данные:
На вход программы поступает последовательность целых чисел. Количество чисел в последовательности заранее неизвестно. Но известно, что в конце последовательности записано число -9999 и в последовательности всегда есть хотя бы одно число, кроме -9999.

Выходные данные: 
Вывести элементы последовательности на экран через пробел.

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main () {

  int a = 0;
  
  do
  {
    scanf ("%d", &a);
    printf("%d ", a);
  } while ( a != -9999);
  
  printf ("loh-pidr");
  
    return 0;
}


